ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ВзаимодействиеСПартнером/ЖБИ_ВзаимодействиеСПартнером.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ВзаимодействиеСПартнером</name>
  <comment>ЖБИ - Взаимодействие с партнером</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КонтактноеЛицо</name>
    <comment>С кем</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <comment>Исполнитель</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСледующегоКонтакта</name>
    <comment>Следующий контакт</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ЖБИ_Важность</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользуется</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Партнер</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_СтатусАктивностиКлиента/ЖБИ_СтатусАктивностиКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_СтатусАктивностиКлиента</name>
  <comment>ЖБИ - Статус активности клиента</comment>
  <resources>
    <name>СтатусКонтрагента</name>
    <type>
      <types>EnumRef.ЖБИ_СтатусКонтрагента</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Партнер</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Enums/ЖБИ_СтатусКонтрагента/ЖБИ_СтатусКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖБИ_СтатусКонтрагента</name>
  <comment>ЖБИ - Статус контрагента</comment>
  <enumValues>
    <name>ВРаботе</name>
    <comment>В работе</comment>
  </enumValues>
  <enumValues>
    <name>НеВРаботе</name>
    <comment>Не в работе</comment>
  </enumValues>
  <enumValues>
    <name>ВПроработке</name>
    <comment>В проработке</comment>
  </enumValues>
</mdclass:Enum>

ЖБИ_УТ11.РасширениеЖБИ/src/Enums/ЖБИ_Важность/ЖБИ_Важность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖБИ_Важность</name>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
</mdclass:Enum>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ВзаимодействиеСПартнером/Forms/ФормаЗаписи/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ 

&НаСервереБезКонтекста
Функция ПроверитьСтатусНеВРаботе(Партнер,Отказ)
	
	Результат			= Ложь;
	СтатусКонтрагента 	= Перечисления.ЖБИ_СтатусКонтрагента.ПустаяСсылка();
	Запрос 				= Новый Запрос;
	Запрос.УстановитьПараметр("Партнер",Партнер);
	Запрос.Текст 		= "ВЫБРАТЬ
	             	  		|	ЖБИ_СтатусАктивностиКлиента.СтатусКонтрагента КАК СтатусКонтрагента
	             	  		|ИЗ
	             	  		|	РегистрСведений.ЖБИ_СтатусАктивностиКлиента КАК ЖБИ_СтатусАктивностиКлиента
	             	  		|ГДЕ
	             	  		|	ЖБИ_СтатусАктивностиКлиента.Партнер = &Партнер";
	РезультаЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультаЗапроса.Следующий() Тогда 
		Если РезультаЗапроса.СтатусКонтрагента = Перечисления.ЖБИ_СтатусКонтрагента.НеВРаботе Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	Если Не Результат Тогда 
		Запрос.УстановитьПараметр("Партнер",Партнер);
		Запрос.Текст 		= "ВЫБРАТЬ
		             		  |	ЖБИ_ВзаимодействиеСПартнером.Период КАК Период,
		             		  |	ЖБИ_ВзаимодействиеСПартнером.Партнер КАК Партнер
		             		  |ИЗ
		             		  |	РегистрСведений.ЖБИ_ВзаимодействиеСПартнером КАК ЖБИ_ВзаимодействиеСПартнером
		             		  |ГДЕ
		             		  |	ЖБИ_ВзаимодействиеСПартнером.Партнер = &Партнер";
		Если Запрос.Выполнить().Выбрать().Количество()=0 Тогда
			Результат = Истина; //первая запись		
		КонецЕсли;
	КонецЕсли;
	
	Если Результат Тогда
		ТаблицаНабораЗаписей 		= РегистрыСведений.ЖБИ_СтатусАктивностиКлиента.ПолучитьПустуюТаблицуНаборЗаписей();
		НоваяСтр 					= ТаблицаНабораЗаписей.Добавить();	
		НоваяСтр.Партнер 			= Партнер;
		НоваяСтр.СтатусКонтрагента	= Перечисления.ЖБИ_СтатусКонтрагента.ВПроработке;
		СообщениеОбОшибке 			= "";
		РезультатЗаписи 			= РегистрыСведений.ЖБИ_СтатусАктивностиКлиента.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,,СообщениеОбОшибке);
		Если НЕ РезультатЗаписи Тогда 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Результат;		
	
КонецФункции

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	Элементы.НеИспользуется.Доступность = ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_НачальникОтделаСбыта")
												ИЛИ ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_НачальникОтделаЛогистики")
												ИЛИ ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_ОсновнаяРоль");	 
											
	ТолькоПросмотрПоля = ЗначениеЗаполнено(Запись.КонтактноеЛицо); 
	Элементы.Период.ТолькоПросмотр 					= ТолькоПросмотрПоля; 
	Элементы.Партнер.ТолькоПросмотр 				= ТолькоПросмотрПоля;
	Элементы.КонтактноеЛицо.ТолькоПросмотр 			= ТолькоПросмотрПоля;
	Элементы.Исполнитель.ТолькоПросмотр 			= ТолькоПросмотрПоля; 
	Элементы.ДатаСледующегоКонтакта.ТолькоПросмотр 	= ТолькоПросмотрПоля;
КонецПроцедуры


#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	УстановитьДоступностьЭлементовФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 	
	Если НЕ ЗначениеЗаполнено(Запись.Важность) Тогда
		Если ПроверитьСтатусНеВРаботе(Запись.Партнер, Отказ) Тогда 
			Запись.Важность = ПредопределенноеЗначение("Перечисление.ЖБИ_Важность.Высокая");
		Иначе 
			Запись.Важность = ПредопределенноеЗначение("Перечисление.ЖБИ_Важность.Низкая");
		КонецЕсли;
	КонецЕсли;  	
КонецПроцедуры

#КонецОбласти
